tests/test-02.tex
% Created 2015-05-04 Mon 11:31
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage{minted}
\usemintedstyle{default}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Test 02}
\author{CSci 515 Spring 2015}
\date{2015-05-04}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Test 02 Spring 2015},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Dates:}
\label{sec-1}


\begin{center}
\begin{tabular}{ll}
 Due:  &  In Lab, Wednesday March 11, by 4:05 pm (lab end time)  \\
\end{tabular}
\end{center}
\section*{Description}
\label{sec-2}

You have 2 hours (our regularly scheduled lab time) to complete the
following tasks.  Create a single file, named test02.cpp, in a visual
studio project called Test02.  Set up the Visual Studio projects using
the normal settings for our class and labs, as we have practiced for
the past 15 weeks.  The file you submit to eCollege should be the
resulting test02.cpp.  It should contain only a single \verb~main()~
function, and any other functions and code you are asked to write for
the following tasks.

Perform the following tasks:

\begin{enumerate}
\item Here is an implementation of the \verb~bubbleSort()~ function we
   used in class to sort an array of integers in ascending
   order:

\begin{verbatim}
/** Bubble Sort
 * Sort an array of integers using a Bubble sort.
 * Bubblesort works in this manner.  On the first pass we start at
 * index 0 and compare successive items.  We swap the items if they
 * are out of order.  The result is that on the first pass, the
 * largest item will be "bubbled up" to the largest index.  On the
 * next pass, we do the same thing, but since the last item is already
 * bubbled into place, we only pass through the N-1 items.  We do this
 * for N passes.  Bubble sort is very inefficient, it is an O(N^2)
 * algorithm.
 *
 * @param values An array of integers.  The array to be sorted.  The
 *   array is passed by reference and is sorted in place in memory.
 *   The array is sorted in ascending order.
 * @param size int The size of the array to sort.
 *
 * @returns void Nothing is returned explicitly but as a
 *   result of calling this function the array
 *   that is passed in will be sorted into ascending order.
 */
void bubbleSort(int values[], int size)
{
  // outer loop, perform N passes
  for (int pass = 0; pass < size; pass++)
  {
    // inner loop, bubble up items from index 0 up to size-pass-1 index
    for (int idx = 0; idx < (size - pass - 1); idx++)
    {
      // if the values are out of order, swap them
      if (values[idx] > values[idx + 1])
      {
        int tmp = values[idx];
        values[idx] = values[idx + 1];
        values[idx + 1] = tmp;
      }
    }
  }
}
\end{verbatim}
   Modify this function to accept an array of floating point values
   instead.  Then modify the function to sort the values in descending
   rather than ascending order (e.g. The largest float should end up
   at index 0, the next largest at index 1, etc. and the smallest at
   the last index in the array).  In your \verb~main()~ function, create an
   array of 5 floats, and initialize the array with the following
   values: \verb~{-3.8, 4.2, 9.7, -2.5, 5.6}~.  Demonstrate calling your
   modified \verb~bubbleSort()~ function with this array of floats, and use
   a loop in your \verb~main()~ function to display the values in the array
   after the array has been sorted.  See the example output below for
   how you should format your resulting output for this task 1.
\item Create a structure called \verb~Data~.  This structure should have 3
   member fields.  The first field is called \verb~speed~, and should be of
   type float, and the second field is called \verb~rank~ and should be of
   type int.  The third field is a discrete category variable.  You
   should define an enumerated type, called \verb~Category~.  The valid
   categories are \verb~HIGH_PERFORMANCE~, \verb~MID_PERFORMANCE~,
   \verb~LOW_PERFORMANCE~.  The \verb~Data~ structure should have a third field
   named \verb~perfCategory~ of type \verb~Category~.  Write a function called
   \verb~generateData()~ that takes an array of \verb~Data~ items as its first
   parameter, and an integer variable called \verb~size~ as its second
   parameter.  This function should initialize all of the fields in
   each item of the given array of \verb~Data~ items with random values.
   For the \verb~speed~ float, create a value in the range from 0.0 to
   10.0.  For the \verb~rank~ integer, create a value in the range from 0
   to 10. And generate a random number from 0 to 2 to use to randomly
   pick one of the performance categories for the \verb~perfCategory~
   field.  In your \verb~main~ function, create an array of 20 \verb~Data~
   structures, and demonstrate calling your \verb~generateData()~ on this
   array to randomly initialize the fields of all of the \verb~Data~ items
   with random data.  In your \verb~main~ function, after generating the
   random data, display the speed, rank and perfCategory for the item
   at index 3 of your array.  See the example output below, but
   remember since you generate the data randomly, your values for the
   item at index 3 will of course differ from those shown.
\item The following is the simple definition of a self-referential
   structure we used in class for creating linked lists

\begin{verbatim}
// A self-referential structure
struct Node
{
  int data;
  Node* nextPtr;
};
\end{verbatim}
   Add this structure definition to your test02.cpp file.  In your
   \verb~main()~ function, create a linked list by hand of 4 nodes.  Name
   the nodes \verb~node1~, \verb~node2~, \verb~node3~ and \verb~node4~, and initialize
   them with the integer values 10, 20, 30, 40, respectively.  Also
   link together the nodes into a linked list, such that \verb~node1~ is
   the head node, and it points to \verb~node2~ which points to \verb~node3~
   which points to \verb~node4~.  \verb~node4~ should also be correctly
   initialized to be the final node in the linked list (using the NULL
   pointer convention).  Create a pointer to a \verb~Node~ item, and set it
   so it is pointing to the head \verb~node1~ of your linked list.  Demonstrate
   accessing the value in \verb~node4~ from your pointer to the head node using
   a single output statement (e.g. starting from your pointer to the head
   node, follow the nextPtr pointers till you arrive at \verb~node4~ and then
   access its value).  An example of the desired output for this task
   3 is shown in the example output below.
\item Write a function to insert a node into a linked list of nodes at
   the end of the linked list.  This function should be called
   \verb~insertAtBack()~.  This function will take a pointer to the head of
   a linked list of \verb~Node~ as the first parameter and to a single
   unlinked \verb~Node~ as the second parameter, which will be inserted on
   the end of the list.  This function should insert the given \verb~Node~
   on to the end of the linked list of nodes it is given.  For this
   test, you can ignore the case were the given list of nodes is
   empty, and for now just assume you are always given a valid list of
   nodes with at least 1 node in the list.  In your main function,
   create a new node called \verb~node5~ and initilaize it with the
   value 50.  Demonstrate calling your function in \verb~main()~ by having
   it append this node \verb~node5~ to the end of the list you created by
   hand in task 3.
\end{enumerate}

Your program output for the 4 previous tasks should look something
close to the following when I run your program:


\begin{verbatim}
Task 1: array of floats after sorting:
val[0] = 9.7
val[1] = 5.6
val[2] = 4.2
val[3] = 2.5
val[4] = -3.8

Task 2: values for item at index 3:
  speed: 8.35223
  rank: 8
  perfCategory: 2

Task 3: value of node4, accessed through pointer to head node: 40

Task 4: value of node5, accessed through pointer to head node: 50
\end{verbatim}
\section*{Test Submission}
\label{sec-3}


An eCollege dropbox has been created for this test.  You should upload
your version of the test by the end of test time to the eCollege
dropbox named \verb~Test 02~.  Work submitted by the end of the allotted
time will be considered, but after the test ends you may no longer
submit work, so make sure you submit your best effort by the test end
time in order to receive credit.
\section*{Requirements and Grading Rubrics}
\label{sec-4}
\subsection*{Program Execution, Output and Functional Requirements}
\label{sec-4-1}


\begin{enumerate}
\item Your program must compile, run and produce some sort of output to
   be graded. You will loose at least 1/3 of the total points (33) if
   your program does not compile and run when submitted.
\item 10 pts (1 letter grade).  Up to 1 letter grade will be awarded for
   formatting and style issues for the test.  Your program must meet
   (most) all of the standard class style/formatting guidelines that
   we have been practicing and using in our labs and assignments for
   this course.
\item 20 pts. Task 1.  You must successfully modify the sort function as
   required in task 1 and demonstrate calling it.
\item 25 pts.  Task 2.  You must define the structure and enumerated type
   as described.  Your function must work to correctly initialize
   an array of \verb~Data~ structures with random values as described.
\item 20 pts. Task 3.  You must correctly create the indicated linked
   list by hand as described.  You must demonstrate following
   pointers to get the value at \verb~node4~ from the head node as
   required.
\item 25 pts.  Task 4. You must correctly define the insert at back
   function as described, and it must be implemented correctly.
\end{enumerate}
\subsection*{Program Style}
\label{sec-4-2}


Your programs must conform to the style and formatting guidelines given for this course.
The following is a list of the guidelines that are required for the lab to be submitted
this week.

\begin{enumerate}
\item The file header for the file with your name and program information
  and the function header for your main function must be present, and
  filled out correctly.
\item A function header must be present for all functions you define.
   You must document the purpose, input parameters and return values
   of all functions.  Your function headers must be formatted exactly
   as shown in the style guidelines for the class.
\item You must indent your code correctly and have no embedded tabs in
  your source code. (Don't forget about the Visual Studio Format
  Selection command).
\item You must not have any statements that are hacks in order to keep
   your terminal from closing when your program exits (e.g. no calls
   to system() ).
\item You must have a single space before and after each binary operator.
\item You must have a single blank line after the end of your declaration
  of variables at the top of a function, before the first code
  statement.
\item You must have a single blank space after , and \verb~;~ operators used as a
  separator in lists of variables, parameters or other control
  structures.
\item You must have opening \verb~{~ and closing \verb~}~ for control statement blocks
  on their own line, indented correctly for the level of the control
  statement block.
\item All control statement blocks (if, for, while, etc.) must have \verb~{~
   \verb~}~ enclosing them, even when they are not strictly necessary
   (when there is only 1 statement in the block).
\begin{enumerate}
\item You should attempt to use meaningful variable and function names in
   your program, for program clarity.  Of course, when required, you
   must name functions, parameters and variables as specified in the
   assignments.  Variable and function names must conform to correct
   \verb~camelCaseNameingConvention~ .
\end{enumerate}
\end{enumerate}

Failure to conform to any of these formatting and programming practice
guidelines for this test will result in loosing 1 letter grade You can
get a B for this test if you do it perfectly, but have bad or missing
style/formatting.  To get an A, however, you need to follow (most) of
the style/formatting requirements for this course on your test code.

\end{document}
